costinm/dmesh/fw/boot/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_RESERVE_RTC_MEM=y
CONFIG_BOOTLOADER_RESERVE_RTC_SIZE=0x20
CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC=y
CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC_SIZE=0x20
CONFIG_BOOTLOADER_WDT_ENABLE=y
# Stage2 diagnostics are carried by the first framed boot.identity packet.
# Do not mix bootloader text with ROM output on the managed UART.
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
# The stage2 image is a production recovery component: keep diagnostics out
# of the shipped image and optimize all project code for size.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
CONFIG_XTAL_FREQ_AUTO=y
CONFIG_ESP32_XTAL_FREQ_AUTO=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=n
